## Revising Pandas

In [1]:
import pandas as pd

In [4]:
orders = pd.read_table('http://bit.ly/chiporders')

In [5]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [20]:
user_cols = ["Name of col 1", "name of col 2", "name of col 3", "name of col 4", "test1", "test2", "test3"]
users = pd.read_table('http://bit.ly/movieusers', sep="|", header = None, names = user_cols)

## All strings in user_cols will be given as names of the columns, 

# if lesser names are provided than number of columns, like 3 names for 5 cols.,
# last 3 cols will be given the names, and rest cols would act as row headings

# While if more names are given, last rows will be filled up by "NaN" (Not a Number)


users

,Name of col 1,name of col 2,name of col 3,name of col 4,test1,test2,test3
0,1,24,M,technician,85711,NaN,NaN
1,2,53,F,other,94043,NaN,NaN
2,3,23,M,writer,32067,NaN,NaN
3,4,24,M,technician,43537,NaN,NaN
4,5,33,F,other,15213,NaN,NaN
...,...,...,...,...,...,...,...
938,939,26,F,student,33319,NaN,NaN
939,940,32,M,administrator,02215,NaN,NaN
940,941,20,M,student,97229,NaN,NaN
941,942,48,F,librarian,78209,NaN,NaN
942,943,22,M,student,77841,NaN,NaN

In [33]:
print(users["name of col 4"])
# printing a particular column
print(type(users))
# To show that the object is a pandas dataframe

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: name of col 4, Length: 943, dtype: object
<class 'pandas.core.frame.DataFrame'>

In [34]:
users.test1
# Other way of calling out to print a column, 
# TIP: try not to give spaces in the names of the columns

0      85711
1      94043
2      32067
3      43537
4      15213
       ...
938    33319
939    02215
940    97229
941    78209
942    77841
Name: test1, Length: 943, dtype: object

In [36]:
# to print the dimensions of the dataframe
users.shape

(943, 7)

In [45]:
# similar to string append feature ---> "ab" + "cd" = "abcd", we can do it with pandas series

users["newly_inserted_column"] = users["name of col 4"] + ', ' + users["name of col 3"]

# NOTE: works only for strings

users.head

<bound method NDFrame.head of      Name of col 1  name of col 2 name of col 3  name of col 4  test1  test2  \
0                1             24             M     technician  85711    NaN
1                2             53             F          other  94043    NaN
2                3             23             M         writer  32067    NaN
3                4             24             M     technician  43537    NaN
4                5             33             F          other  15213    NaN
..             ...            ...           ...            ...    ...    ...
938            939             26             F        student  33319    NaN
939            940             32             M  administrator  02215    NaN
940            941             20             M        student  97229    NaN
941            942             48             F      librarian  78209    NaN
942            943             22             M        student  77841    NaN

     test3 newly_inserted_column
0      NaN         technician, M
1      NaN              other, F
2      NaN             writer, M
3      NaN         technician, M
4      NaN              other, F
..     ...                   ...
938    NaN            student, F
939    NaN      administrator, M
940    NaN            student, M
941    NaN          librarian, F
942    NaN            student, M

[943 rows x 8 columns]>

In [54]:
# Get the statistics of the table columns with numeric values
users.describe(include = ["object"])

       name of col 3 name of col 4  test1 newly_inserted_column
count            943           943    943                   943
unique             2            21    795                    41
top                M       student  55414            student, M
freq             670           196      9                   136

In [56]:
users.describe()

       Name of col 1  name of col 2  test2  test3
count     943.000000     943.000000    0.0    0.0
mean      472.000000      34.051962    NaN    NaN
std       272.364951      12.192740    NaN    NaN
min         1.000000       7.000000    NaN    NaN
25%       236.500000      25.000000    NaN    NaN
50%       472.000000      31.000000    NaN    NaN
75%       707.500000      43.000000    NaN    NaN
max       943.000000      73.000000    NaN    NaN

In [58]:
users.dtypes

Name of col 1              int64
name of col 2              int64
name of col 3             object
name of col 4             object
test1                     object
test2                    float64
test3                    float64
newly_inserted_column     object
dtype: object

### TIP: 
- for using the dot notation with data frames, type "users." and then hit **TAB** for finding all possible options.
- for finding the possible parameters of a function, bring the cursor in the parenthesis, and the press **"SHIFT + TAB"**